online_benchmark_log/mi35x/GROK1/v0.5.6-rocm700-mi35x-20251205_GROK1_MOE-I4F8_online/sglang_client_log_GROK1_aiter_1_run1_20251205_145211.log
Running benchmark with request rate: 1 (Run 1) for mode aiter
Run started at: 2025-12-05 14:52:11 PST
Executing: python3 -m sglang.bench_serving --backend sglang --tokenizer "/data/amd--grok-1-W4A8KV8" --dataset-name random --random-input 1024 --random-output 1024 --num-prompts 300 --request-rate 1
benchmark_args=Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=None, dataset_name='random', dataset_path='', model=None, served_model_name=None, tokenizer='/data/amd--grok-1-W4A8KV8', num_prompts=300, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=1.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)

WARNING It is recommended to use the `Chat` or `Instruct` model for benchmarking.
Because when the tokenizer counts the output tokens, if there is gibberish, it might count incorrectly.

Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=30000, dataset_name='random', dataset_path='', model='/data/amd--grok-1-W4A8KV8', served_model_name=None, tokenizer='/data/amd--grok-1-W4A8KV8', num_prompts=300, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=1.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)

#Input tokens: 152612
#Output tokens: 160347
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 300/300 [05:19<00:00,  1.06s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    1.0       
Max request concurrency:                 not set   
Successful requests:                     300       
Benchmark duration (s):                  319.04    
Total input tokens:                      152612    
Total input text tokens:                 152612    
Total input vision tokens:               0         
Total generated tokens:                  160347    
Total generated tokens (retokenized):    163422    
Request throughput (req/s):              0.94      
Input token throughput (tok/s):          478.34    
Output token throughput (tok/s):         502.59    
Peak output token throughput (tok/s):    883.00    
Peak concurrent requests:                37        
Total token throughput (tok/s):          980.93    
Concurrency:                             22.92     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   24377.07  
Median E2E Latency (ms):                 24492.41  
---------------Time to First Token----------------
Mean TTFT (ms):                          181.86    
Median TTFT (ms):                        197.49    
P99 TTFT (ms):                           324.18    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          45.40     
Median TPOT (ms):                        45.57     
P99 TPOT (ms):                           50.67     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           45.35     
Median ITL (ms):                         40.79     
P95 ITL (ms):                            74.33     
P99 ITL (ms):                            162.46    
Max ITL (ms):                            488.35    
==================================================
Run completed at: 2025-12-05 14:57:40 PST
Run duration: 329 seconds
----------------------------------------